Repository: liyishibeck-ctrl/Buddhist_Text_Analysis_Platform
Catalog: data/raw/tibetan/84000/data-translation-memory-master/toh1-6-v3.tmx
Source language: bo
Languages: en

source: །དེ་ནས་རྒྱལ་པོ་ཕྱིར་བྱུང་ནས་དཀོར་ཁང་དུ་འདུག་པ་དང་། བྲམ་ཟེ་དུས་དཔོག་གིས་རྒྱལ་བ་དང་ཚེ་སྤེལ་བ་དག་བྱས་ཏེ་འདུག་ནས་སྨྲས་པ། ལྷ་ཅིའི་སླད་དུ་ཐུགས་ངན་གྱི་ཁང་པར་ཞུགས་ཏེ་བཞུགས།
en: “The king then left the room and sat in the treasury. After wishing the king victory and long life, and having sat down, Brahmin Velāma asked, ‘Your Majesty, why are you staying in the lamentation room?’

source: རྒྱལ་པོས་ཇི་ལྟར་གྱུར་པ་ཐམས་ཅད་བྲམ་ཟེ་དུས་དཔོག་ལ་རྒྱས་པར་སྨྲས་པ་དང་། དེས་སྨྲས་པ་ལྷ་འཇིག་རྟེན་ནི་རང་གི་ལས་ཀྱི་འབྲས་བུ་ལ་སྤྱོད་པ་ལགས་པས་འདི་ལ་ཐུགས་ངན་བགྱིར་མ་མཆིས་སོ།
en: “The king told the brahmin Velāma in detail all about what had happened. The brahmin said, ‘Your Majesty, since beings in this world experience the fruit of their karma, you do not need to lament about this.

source: །སེམས་ཅན་ལེགས་པའི་ལས་བགྱིད་པ་རྣམས་ཀྱང་མཆིས། ཉེས་པའི་ལས་བགྱིད་པ་རྣམས་ཀྱང་མཆིས། གཉི་གའི་ལས་བགྱིད་པ་ཡང་མཆིས་ཏེ།
en: There are beings that create good karma, that create evil karma, and that create both.

source: འཁོར་ལོས་སྒྱུར་བ་རྣམས་ནི་རྟག་ཏུ་ལས་ལེགས་པ་བགྱིད་དེ། གུམ་ན་ཡང་ལྷ་རྣམས་སུ་སྐྱེ་བར་འགྱུར་རོ།
en: Wheel-turning kings always create good karma and, after their death, are reborn among the gods.

source: །ལྷ་ཡང་འཁོར་ལོས་སྒྱུར་བ་ལགས་ཏེ།
en: Your Majesty is a wheel-turning king, too;

source: མིའི་བདེ་བ་ཁྱད་པར་དུ་འཕགས་པ་བསྟར་ནས་ལྷའི་བདེ་བ་ཡང་ཉམས་སུ་བསྟར་བར་འགྱུར་མོད་ཀྱི།
en: you will experience divine happiness after experiencing the best human happiness.

source: ལྷ་འོན་ཀྱང་མཐོ་རིས་ཀྱི་ཐེམ་སྐས་སུ་གྱུར་པ་མཆོད་སྦྱིན་ལ་བརྩོན་པར་མཛོད་ཅིག །དེ་ནས་རྒྱལ་པོས་བློན་པོ་རྣམས་ལ་བསྒོ་བ།
en: Nonetheless, Your Majesty, you should exert yourself in making offerings, which is the staircase to heaven.’

source: ཤེས་ལྡན་དག་ཡུལ་ཐམས་ཅད་དུ་དྲིལ་སྒྲོགས་སུ་ཆུག་སྟེ།
en: “The king ordered his ministers, ‘Sirs, proclaim this throughout the country with the ringing of bells:

source: རྒྱལ་པོ་གཏན་པ་མེད་པའི་མཆོད་སྦྱིན་བྱེད་ཀྱིས་ཁྱེད་ཤོག་ལ་ལོངས་སྤྱོད་ཅིག་ཅེས་སྒོ་ཤིག །དེ་ནས་རྒྱལ་པོས་སྦྱིན་པའི་ཁང་པ་རྩིག་ཏུ་བཅུག་ནས་ཟས་འདོད་པ་རྣམས་ལ་ནི་ཟས། བཏུང་བ་འདོད་པ་རྣམས་ལ་ནི་བཏུང་བ་བྱིན་ནོ།
en: “The king will make a limitless offering; you should come and enjoy it.” ’ “The king then had an offering hall built and gave food to those who sought food, and drink to those who sought drink.

source: །དེར་འབྲས་ཁུ་དབོ་བའི་དོང་བྱས་ནས།
en: “There a pit was dug to pour the water used for boiling rice (ācāma).

source: དེར་དྲོན་པོ་དག་བླུགས་པ་དང་བསིལ་བར་གྱུར་པས་མ་དྲོས་པ་མ་དྲོས་པ་ཞེས་བྱ་བར་གྲགས་སོ། །དེའི་འབྲས་ཁུ་དང་འབྲས་བཀྲུས་པའི་ཁུ་བས་ལོ་བཅུ་གཉིས་ཚང་པར་བཀང་བས་ལུད་པར་གྱུར་པའི་ཁ་དེ་ནས་འབབ་ཆུར་བབ་པས་འབྲས་ཁུའི་ཆུ་འབྲས་ཁུའི་ཆུ་ཞེས་བྱ་བར་གྲགས་སོ།། །།སྡོམ་ལ།
en: Since the hot water became cold when it was poured there, the pit was named Anavatapta, ‘unheated.’ After twelve years, the water used for boiling rice and the water used for washing rice flowed out as a river through a valley, and the river was named Ācāma River.” Chapter Nine Summary of Contents:

source: གཞོན་ནུ་བསྐྱེད་དང་གླང་ཆེན་སྒྲ།
en: Kumāravardhana, Krauñcāna, Aṅgadikā, Maṇivatī Sālabalā, Sālibalā,

source: །དཔུང་རྒྱན་ལྡན་དང་ནོར་བུ་ཅན།
en: Suvarṇaprastha, Sāketā

source: །ས་ལ་སྟོབས་དང་ས་ལའི་སྟོབས།
en: Rice Soup, Śrāvastī,

source: །གསེར་བྲེ་དང་ནི་གནས་བཅས་དང་། །ཐུག་པ་དང་ནི་མཉན་ཡོད་དང་། །མ་དྲོས་གྲོང་ཁྱེར་བིན་དུ་དང་། །ཡངས་པ་ཅན་ནི་ཐ་མ་ཡིན།
en: Anavatapta, Nagarabindu, And Vaiśālī. I.

source: །དེ་ནས་བཅོམ་ལྡན་འདས་ཡུལ་གཞོན་ནུ་བསྐྱེད་པར་གཤེགས་ནས་གཞོན་ནུ་བསྐྱེད་པར་ཚེ་དང་ལྡན་པ་ཀུན་དགའ་བོ་ལ་བཀའ་སྩལ་པ། ཀུན་དགའ་བོ་ཕྱོགས་འདིར་རྒྱལ་པོ་གསོ་སྦྱོང་འཕགས་ཞེས་བྱ་བ་བཙས་ནས་འདི་ཉིད་དུ་ཆེན་པོར་གྱུར་ཏོ། །དེས་ན་གྲོང་ཁྱེར་ཡང་གཞོན་ནུ་བསྐྱེད་པ་ཞེས་བྱ་བར་གྲགས་སོ།
en: Kumāravardhana Thereupon the Blessed One arrived in the country of Kumāravardhana, where he said to the venerable Ānanda, “Ānanda, in this place a king named Upoṣadha was born and grew up. Therefore, this city was named Kumāravardhana.” II. Krauñcāna

source: །ཀྲུང་ཀྲུང་སྒྲ་ཅན་དུ་གཤེགས་ནས། དེ་ནས་བཅོམ་ལྡན་འདས་ཀྱིས་ཚེ་དང་ལྡན་པ་ཀུན་དགའ་བོ་ལ་བཀའ་སྩལ་པ། ཀུན་དགའ་བོ་ཀྲུང་ཀྲུང་སྒྲ་འདིར་རྒྱལ་པོ་གསོ་སྦྱོང་འཕགས་ཀྱི་གླང་པོ་ཆེ་དམ་པས་ཀྲུང་ཀྲུང་ཞེས་བྱ་བའི་སྐད་ཕྱུང་བས། ཀྲུང་ཀྲུང་ཅན་ཀྲུང་ཀྲུང་ཅན་ཞེས་བྱ་བར་གྲགས་སོ།
en: The Blessed One went to Krauñcāna and said to the venerable Ānanda, “Ānanda, since the excellent elephant of King Upoṣadha uttered the cry ‘krauñca, krauñca’ in this Krauñcāna, the place was named Krauñcāna.” III.

source: །དཔུང་རྒྱན་ལྡན་དུ་གཤེགས་ནས་དཔུང་རྒྱན་ལྡན་གྱི་ཕྱོགས་ཞིག་ཏུ་འཛུམ་པ་མཛད་དོ། །ཞེས་བྱ་བ་ནས་སངས་རྒྱས་བཞིའི་གདན་ཞེས་བྱ་བ་རྒྱས་པར་གོང་མ་བཞིན་དུའོ།
en: Aṅgadikā Having gone to Aṅgadikā, in a certain place in Aṅgadikā the Blessed One smiled . . . (the phrase about the seat of four buddhas should be recited in detail). IV. Maṇivatī

source: །ནོར་བུ་ཅན་དུ་གཤེགས་ནས་ནོར་བུ་ཅན་དུ་ཚེ་དང་ལྡན་པ་ཀུན་དགའ་བོ་ལ་བཀའ་སྩལ་པ། ཀུན་དགའ་བོ་ནོར་བུ་ཅན་འདིར་བྱང་ཆུབ་སེམས་དཔས་ནོར་བུ་མང་པོའི་མཆོད་སྦྱིན་བྱས་པས་ནོར་བུ་ཅན་ཞེས་བྱ་བར་གྲགས་སོ། །ས་ལའི་སྟོབས་སུ་གཤེགས་ནས།
en: Having gone to Maṇivatī, the Blessed One said to the venerable Ānanda there, “Ānanda, since the Bodhisattva made an offering of many jewels (maṇi) in this Maṇivatī, this place was named Maṇivatī (Where There Are Jewels).” V. Sālabalā Having gone to Sālabalā, in a certain place in Sālabalā the Blessed One smiled . . . (the phrase about the seat of four buddhas should be recited in detail). VI. Sālibalā

source: ས་ལའི་སྟོབས་ཀྱི་ཕྱོགས་ཞིག་ཏུ་འཛུམ་པ་མཛད་ནས་ཞེས་བྱ་བ་ནས་སངས་རྒྱས་བཞིའི་གདན་ཞེས་བྱ་བ་རྒྱས་པར་གོང་མ་བཞིན་དུའོ།
en: Having gone to Sālibalā, in a certain place in Sālibalā the Blessed One smiled . . . (the phrase about the seat of four buddhas should be recited in detail). VII.

source: །གསེར་གྱི་བྲེར་གཤེགས་ནས་ཀུན་དགའ་བོ་གསེར་གྱི་བྲེ་འདིར་བྱང་ཆུབ་སེམས་དཔས་གསེར་མང་པོ་མཆོད་སྦྱིན་བྱས་པས་ད་དུང་ཡང་བྲམ་ཟེ་རྣམས་གསེར་བྲེས་འཇལ་ཞིང་འགེད་པས་གསེར་གྱི་བྲེ་གསེར་གྱི་བྲེ་ཞེས་བྱ་བར་གྲགས་སོ།
en: Suvarṇaprastha Having gone to Suvarṇaprastha, the Blessed One said, “Ānanda, in this Suvarṇaprastha the Bodhisattva made an offering of much gold (suvarṇa). Today brahmins still distribute gold, weighing it in units of prastha. Therefore, this place was named Suvarṇaprastha.” VIII. Sāketā

source: །གནས་བཅས་སུ་གཤེགས་ནས་གནས་བཅས་སུ་ཚེ་དང་ལྡན་པ་ཀུན་དགའ་བོ་ལ་བཀའ་སྩལ་པ། ཀུན་དགའ་བོ་གནས་བཅས་འདིར་རྒྱལ་པོ་གསོ་སྦྱོང་འཕགས་ཞེས་བྱ་བ་འབྱོར་པ་དང་། རྒྱས་པ་དང་། བདེ་བ་དང་། ལོ་ལེགས་པ་དང་། སྐྱེ་བོ་དང་མི་མང་པོས་གང་བ་ན་རྒྱལ་སྲིད་བྱེད་དུ་འཇུག་གོ།
en: Having gone to Sāketā, the Blessed One said to the venerable Ānanda there, “ Ānanda, in this Sāketā a king named Upoṣadha ruled over the country, which was rich, prosperous, peaceful, abundant in food, and full of many people.

source: །དེ་དུས་གཞན་ཞིག་ན་སྤྱི་བོར་ཤ་རྨེན་འཇམ་ཞིང་ཤིན་ཏུ་འཇམ་པ་ཞིག་སྐྱེས་ཏེ།
en: One day a soft, fleshy tumor developed on the crown of his head;

source: དཔེར་ན་ཤིང་བལ་གྱི་འདའ་བའམ་རས་བལ་གྱི་འདའ་བ་བཞིན་དུ་ཅུང་ཟད་ཀྱང་གནོད་པ་སྐྱེད་པར་མི་བྱེད་དོ།
en: it was exceptionally soft, just like tūla cotton or karpāsa cotton, and caused no pain.

source: །དེ་ཡོངས་སུ་སྨིན་ནས་བརྟོལ་བ་ལས་གཞོན་ནུ་ཞིག་བྱུང་ན།
en: When it had fully enlarged, it burst open and a boy emerged from it.

source: གཟུགས་བཟང་བ་མཛེས་པ་བལྟ་ན་སྡུག་པ། པགས་པའི་མདོག་གསེར་འདྲ་བ་ཞེས་བྱ་བ་ནས་ཡན་ལག་ཐམས་ཅད་དང་ལྡན་པ་ཞེས་བྱ་བའི་བར་གོང་མ་བཞིན་དུ་སྟེ། །སྤྱི་བོ་སྐྱེས་སྤྱི་བོ་སྐྱེས་ཞེས་བྱ་བར་གྲགས་སོ།
en: He was well proportioned, attractive, pleasant to behold, and gold in complexion . . . and every major limb and minor appendage of his body was complete. Since he was born (jāta) from the crown of the head (mūrdhni), he was named Mūrdhnāta.

source: །རྒྱལ་པོ་གསོ་སྦྱོང་འཕགས་ཀྱིས་གཞོན་ནུ་བྱུང་མ་ཐག་ཏུ་བཙུན་མོའི་འཁོར་དྲུག་ཁྲིའི་ནང་དུ་བཀྲི་བ་དང་། མཐོང་མ་ཐག་ཏུ་བཙུན་མོ་དེ་ཐམས་ཅད་ཀྱི་ནུ་མ་ལས་འོ་མ་ཟགས་ནས་སོ་སོ་ནས་སྨྲས་པ། ང་ལས་ནུ། ང་ལས་ནུ་ཞེས་སྨྲས་པས།
en: “Soon after the prince was born, King Upoṣadha brought him to the harem, where there were sixty thousand consorts. As soon as they saw the prince, milk squirted out from each consort’s breasts, and they said, ‘May he suckle at my breast (*mān dhayatu)!’ Therefore, he was named Māndhātṛ.

source: ང་ལས་ནུ་ང་ལས་ནུ་ཞེས་བྱ་བར་གྲགས་སོ། །དེ་ལ་ཁ་ཅིག་གིས་ནི་སྤྱི་བོ་སྐྱེས།
en: Some people knew him there as Mūrdhnāta, and others as Māndhātṛ.

source: ཁ་ཅིག་གིས་ནི་ང་ལས་ནུ་ཞེས་བྱ་བར་ཤེས་སོ།
en: “Once, when Prince Māndhātṛ

source: །གཞོན་ནུ་ང་ལས་ནུ་ཡུལ་ཞིག་ཏུ་སོང་བ་དང་། རྒྱལ་པོ་གསོ་སྦྱོང་འཕགས་ན་བར་གྱུར་ནས།
en: was away in the countryside, King Upoṣadha became sick.

source: དེ་རྩ་བ་དང་། སྡོང་བུ་དང་། ལོ་མ་དང་། མེ་ཏོག་དང་། འབྲས་བུའི་སྨན་གྱིས་བཀུར་སྟི་བྱས་ཀྱང་། དེ་སླར་ཐུ་བར་གྱུར་ནས།
en: Although he was provided with medicines derived from roots, stalks, leaves, flowers, and fruits, the illness just kept on getting worse.

source: དེས་བློན་པོ་རྣམས་ལ་བསྒོ་བ། ཤེས་ལྡན་དག་མྱུར་དུ་གཞོན་ནུ་ལ་རྒྱལ་སྲིད་ཀྱི་དབང་བསྐུར་བས་དབང་སྐུར་ཅིག །ལྷ་བཀའ་བཞིན་འཚལ་ཞེས་བློན་པོ་རྣམས་ཀྱིས་ཕོ་ཉ་བཏང་ནས་རྒྱལ་པོ་གསོ་སྦྱོང་འཕགས་པ་སྙུང་བར་གྱུར་ནས་དེས་བཀའ་སྩལ་པ།
en: He ordered his ministers, ‘Sirs, quickly anoint the prince as king.’ “ ‘Certainly, Your Majesty.’

source: གཞོན་ནུ་སྤྱན་དྲོངས་ལ་རྒྱལ་སྲིད་ཀྱི་དབང་བསྐུར་བ་ཉམས་སུ་མྱོང་བར་གྱིས་ཤིག་ཅེས་བྱུང་གིས། དེ་བས་ན་གཞོན་ནུ་མྱུར་དུ་གཤེགས་པའི་རིགས་སོ་ཞེས་སྤྲིང་ངོ་། །དེ་ཆས་པ་ན་རྒྱལ་པོ་གསོ་སྦྱོང་འཕགས་ཤིའོ། །དེ་ནས་ཡང་བློན་པོ་རྣམས་ཀྱིས་ཡང་དེ་ལ་ཕོ་ཉ་བཏང་སྟེ།
en: “The ministers sent a messenger, saying, ‘King Upoṣadha has become sick and says, “Call the prince and let him accept the royal anointing.” Hence the prince should come quickly.’ When the messenger had departed, King Upoṣadha died.

source: གཞོན་ནུ་ཁྱེད་ཀྱི་ཡབ་ནོངས་ཀྱིས་གཤེགས་ཏེ་རྒྱལ་སྲིད་བཞེས་སུ་གསོལ་ཞེས་སྤྲིང་བ་དང་། གཞོན་ནུ་ང་ལས་ནུས་བསམས་པ།
en: Then the ministers sent another messenger to the prince, saying, ‘O Prince, your father has passed away.

source: བདག་གི་ཡབ་ནི་ནོངས་ན་བདག་དེར་ཇི་སྟེ་འགྲོ་སྙམ་དུ་བསམས་ནས་དེ་ཉིད་ན་འདུག་པ་དང་། ཡང་བློན་པོ་རྣམས་འདུས་ནས་བློན་པོའི་གཙོ་བོ་ཕོ་ཉར་བཏང་ནས་དེ་སོང་སྟེ་སྨྲས་པ།
en: Please come and accept the kingdom.’ “Prince Māndhātṛ stayed there, thinking, ‘Since my father has passed away, why do I need to go there?’ The ministers again met together and sent the prime minister as a messenger.

source: གཞོན་ནུ་གཤེགས་ལ་རྒྱལ་སྲིད་བཞེས་སུ་གསོལ།
en: He went to the prince and requested, ‘O Prince, please come and accept the kingdom.’

source: དེས་སྨྲས་པ། གལ་ཏེ་བདག་གིས་ཆོས་བཞིན་གྱིས་རྒྱལ་སྲིད་འཐོབ་ན་འདི་ཉིད་དུ་རྒྱལ་སྲིད་ཀྱི་དབང་བསྐུར་བ་འོང་བར་འགྱུར་རོ།
en: “ ‘If I obtain the kingdom according to the Dharma,’ replied the prince, ‘the royal anointing will take place here.’

source: །བློན་པོ་རྣམས་ཀྱིས་སྤྲིང་བ།
en: “The ministers sent a message:

source: ལྷ་རྒྱལ་སྲིད་ཀྱི་དབང་བསྐུར་བ་ལ་ནི་མང་དུ་འཚལ་ཏེ།
en: ‘Your Majesty, the royal anointing requires many things.

source: རིན་པོ་ཆེའི་གཅལ་དང་། སེང་གེའི་ཁྲི་དང་། གདུགས་དང་། ཅོད་པན་དང་། དཔུང་རྒྱན་གྱིས་ཕོ་བྲང་གི་ནང་དུ་རྒྱལ་སྲིད་དབང་བསྐུར་འཚལ་ལོ།
en: We perform the royal anointing in the palace on a jeweled floor with a throne, parasol, crown, and bracelet.

source: །དེ་བས་ན་གཞོན་ནུ་འདི་ཉིད་དུ་གཤེགས་པའི་རིགས་སོ།
en: Therefore, the prince must come to this very place.’

source: །དེས་སྨྲས་པ། གལ་ཏེ་བདག་གིས་ཆོས་བཞིན་གྱིས་རྒྱལ་སྲིད་འཐོབ་པར་འགྱུར་ན་ཐམས་ཅད་འདི་ཉིད་དུ་འོང་གྲང་།
en: “ ‘If I obtain the kingdom according to the Dharma,’ replied the prince, ‘everything necessary will appear here.’

source: གཞོན་ནུ་ང་ལས་ནུའི་མདུན་ནས་འགྲོ་བ་གནོད་སྦྱིན་ལྷ་གནས་ཞེས་བྱ་བ་དེས་རིན་པོ་ཆེའི་གཅལ་དང་། སེང་གེའི་ཁྲི་དེ་ཉིད་དུ་བླངས་སོ།
en: “A yakṣa named Divaukasa, attendant on Prince Māndhātṛ, brought there a jeweled floor and throne.

source: །ཕོ་བྲང་ན་གནས་པ་རྣམས་ཀྱིས་ཀྱང་གདུགས་དང་། ཅོད་པན་དང་། དཔུང་རྒྱན་ཁྱེར་ཏེ་རང་ལྷགས་ཏེ་ཕོ་བྲང་ན་གནས་པ་རང་ལྷགས་ཤིང་རང་ལྷགས་པས་གནས་བཅས་གནས་བཅས་ཞེས་བྱ་བར་གྲགས་སོ།
en: People living in the palace then spontaneously came together, bringing a parasol, crown, and bracelet. Since the people living in the palace spontaneously (svayaṃ) came (āgata), the place was named Sāketā.” IX. Rice Soup

source: །དེ་ནས་བཅོམ་ལྡན་འདས་ཀྱིས་ཚེ་དང་ལྡན་པ་ཀུན་དགའ་བོ་ལ་བཀའ་སྩལ་པ། ཀུན་དགའ་བོ་མཉན་ཡོད་གང་ན་བ་དེར་འདོང་ངོ་།
en: Thereupon the Blessed One said to the venerable Ānanda, “Ānanda, let us go to Śrāvastī.”

source: དེ་ནས་བཅོམ་ལྡན་འདས་མཉན་ཡོད་ནས་རྒྱུ་ཞིང་གཤེགས་པ་དང་། ཇི་ཙམ་ནས་ཕྱོགས་ཤིག་ན་བྲམ་ཟེ་ཞིག་ཟན་མ་ཟོས་པར་ཞིང་རྨེད་པ་ན།
en: Then the Blessed One traveled to Śrāvastī. In a certain place, a brahmin was plowing a field.

source: དེའི་ཆེད་དུ་བུ་མོ་ཞིག་ཐུག་པ་ཁྱེར་ཏེ་འོངས་སོ།
en: He had not had a meal, and a girl brought rice soup for him.

source: །བཅོམ་ལྡན་འདས་ཀྱང་ཕྱོགས་དེ་ཉིད་དུ་གཤེགས་སོ།
en: The Blessed One also came to that place.

source: །དེ་ནས་བྲམ་ཟེས་སངས་རྒྱས་བཅོམ་ལྡན་འདས་ཀྱི་སྐུ་སྐྱེས་བུ་ཆེན་པོའི་མཚན་སུམ་བཅུ་རྩ་གཉིས་ཀྱིས་ལེགས་པར་བརྒྱན་པ། དཔེ་བྱད་བཟང་པོ་བརྒྱད་བཅུས་མཛེས་པར་བྱས་པ། འོད་འདོམ་གང་གིས་བརྒྱན་པ། འོད་ཟེར་ཉི་མ་སྟོང་བས་ལྷག་པ། རིན་པོ་ཆེའི་རི་བོ་འགྲོ་བ་ལྟར་ཀུན་ནས་བཟང་བ་མཐོང་ངོ་།
en: As soon as the brahmin saw the Buddha, the Blessed One, whose body was fully ornamented with the thirty-two marks of a great man, illuminated by the eighty minor marks, ornamented with a fathom-wide halo, and beautiful like a moving mountain of jewels with light surpassing a thousand suns, faith in the Blessed One arose in him.

source: །མཐོང་མ་ཐག་ཏུ་ཡང་དེ་བཅོམ་ལྡན་འདས་ལ་དད་པ་སྐྱེས་ཏེ། ཇི་ལྟར་དགེ་བའི་རྩ་བ་བསགས་པའི་སེམས་ཅན་ལ་ཐོག་མར་སངས་རྒྱས་མཐོང་བ་དེ་ལྟར་ནི་ལོ་བཅུ་གཉིས་སུ་ཞི་གནས་གོམས་པར་བྱས་པ་ལ་སེམས་ལས་སུ་རུང་བ་སྐྱེ་བ་དང་། བུ་མེད་པ་བུ་རྙེད་པ་དང་། དབུལ་པོས་ནོར་གྱི་གཏེར་མཐོང་བ་དང་། རྒྱལ་སྲིད་ལ་དགའ་བ་རྒྱལ་སྲིད་ཀྱི་དབང་བསྐུར་བ་ནི་དེ་ལྟ་མ་ཡིན་ནོ།
en: Whenever a being who has accumulated roots of merit looks at the Buddha for the first time, he experiences far greater pleasure than that of those who have practiced tranquility of mind for a dozen years, those who gain a son after having been childless, those who look upon treasure after having been poor, or those who are anointed as king after having longed for kingship.

source: །དེས་ཐུག་པ་དེ་ཁྱེར་ཏེ་མྱུར་བ་མྱུར་བར་བཅོམ་ལྡན་འདས་གང་ན་བ་དེར་སོང་སྟེ་ཕྱིན་པ་དང་། བཅོམ་ལྡན་འདས་ལ་འདི་སྐད་ཅེས་གསོལ་ཏོ།
en: The brahmin quickly went to the Blessed One, bringing the rice soup.

source: །ཀྱེ་གཽ་ཏ་མ་འདི་ནི་ཐུག་པ་ལགས་ཏེ།
en: When he arrived, he said to the Blessed One, “O Gautama, this is rice soup.

source: གལ་ཏེ་ཤེས་ལྡན་གཽ་ཏ་མ་བདག་ལ་ཐུགས་བརྩེ་ན་འཇམས་གསོལ་ཅིག །དེ་ནས་བཅོམ་ལྡན་འདས་ཀྱིས་བྲམ་ཟེ་དེ་ལ་ཁྲོན་པ་རྙིང་པ་ཞིག་བསྟན་ནས།
en: If the Honorable Gautama has compassion for me, please accept this rice soup.”

source: བྲམ་ཟེ་ཁྱོད་ཀྱིས་གལ་ཏེ་ཡོངས་སུ་བཏང་ན་ཁྲོན་པ་རྙིང་པ་འདིར་ལུགས་ཤིག །དེས་ཁྲོན་པ་རྙིང་པ་དེར་བླུགས་སོ་དེས་ཁྲོན་པ་རྙིང་པ་དེར་བླུགས་པ་དང་། འདི་ལྟར་ཡང་སངས་རྒྱས་རྣམས་ཀྱི་སངས་རྒྱས་ཀྱི་མཐུ་དང་། ལྷ་རྣམས་ཀྱི་ལྷའི་མཐུས་ཁྲོན་པ་རྙིང་པ་དེ་ཐུག་པས་གང་ནས་རླངས་པ་འཐུལ་ཞིང་འདུག་པར་གྱུར་ཏོ།
en: Then the Blessed One indicated to the brahmin an old well and said, “Brahmin, if you are giving it completely, pour it into this old well.” The brahmin poured it into the old well. When he had done this, by the awakened power of the buddhas and the divine power of the gods, the old well became piping hot, full of rice soup.

source: །དེ་ནས་བཅོམ་ལྡན་འདས་ཀྱིས་བྲམ་ཟེ་དེ་བོས་ནས་བྲམ་ཟེ་ཐུག་པ་བྲིམས་ཤིག །དེས་བྲིམ་པར་བརྩམས་པ་ན་བཅོམ་ལྡན་འདས་ཀྱིས་ཇི་ལྟར་དགེ་འདུན་ཐམས་ཅད་ཀྱིས་འཐུངས་ཀྱང་ཁྲོན་པ་རྙིང་པ་དེ་དེ་བཞིན་དུ་ཐུག་པས་གང་ནས་རླངས་པ་འཐུལ་ཞིང་འདུག་པར་འགྱུར་བ་དེ་ལྟར་བྱིན་གྱིས་བརླབས་སོ།
en: The Blessed One then called the brahmin and said, “Brahmin, distribute the rice soup.” When he began to distribute it, the Blessed One exercised his magical power so that even when the entire community had eaten it, the old well remained piping hot, full of rice soup.

source: །དེ་ནས་བྲམ་ཟེ་དེ་ལྷག་པར་ཡང་མངོན་པར་དད་པར་གྱུར་ཏེ། བཅོམ་ལྡན་འདས་ཀྱི་ཞབས་ལ་ཕྱག་བྱས་ཏེ་ཆོས་མཉན་པའི་ཕྱིར་སྤྱན་སྔ་ན་འདུག་པ་དང་། བཅོམ་ལྡན་འདས་ཀྱིས་དེའི་བསམ་པ་དང་། བག་ལ་ཉལ་དང་། ཁམས་དང་། རང་བཞིན་མཁྱེན་ནས་དེ་དང་འདྲ་བར་འཕགས་པའི་བདེན་པ་བཞི་སོ་སོར་རྟོགས་པར་འགྱུར་བའི་ཆོས་བཤད་པ་མཛད་པས་ཞེས་བྱ་བ་ནས་ཐོག་མ་མེད་པའི་དུས་ནས་བསགས་པའི་འཇིག་ཚོགས་ལ་ལྟ་བའི་རིའི་རྩེ་མོ་ཉི་ཤུ་མཐོ་བ་ཡེ་ཤེས་ཀྱི་རྡོ་རྗེས་བཅོམ་ནས་རྒྱུན་དུ་ཞུགས་པའི་འབྲས་བུ་མངོན་སུམ་དུ་བགྱིས་ཏེ།
en: After that, his faith in the Blessed One increased all the more, the brahmin paid homage at the Blessed One’s feet and sat down in front of him in order to hear the Dharma. The Blessed One knew his thinking, proclivity, disposition, and nature and preached the Dharma that was appropriate for him and that caused him to penetrate the four truths of the noble ones. . . . With the vajra of knowledge he leveled the twenty high peaks of the mountain chain of the false view of individuality that had been accumulated since beginningless time, and actualized the fruit of stream-entry.

source: བཙུན་པ་བདག་ནི་འཕགས་སོ། །མངོན་པར་འཕགས་སོ། །ཞེས་བྱ་བའི་བར་གོང་མ་བཞིན་དུའོ།
en: “O Honored One, I have been exalted, truly exalted.

source: །བདག་ནི་བཅོམ་ལྡན་འདས་དང་ཆོས་དང་དགེ་སློང་གི་དགེ་འདུན་ལ་སྐྱབས་སུ་མཆི་ལགས་ཀྱིས། བདག་དགེ་བསྙེན་དུ་གཟུང་དུ་གསོལ།
en: Since I seek refuge in the Blessed One, the Dharma, and the community of monks, may you accept me as a lay brother.

source: །དེ་ནས་བྲམ་ཟེ་དེ་ཚོང་པ་ཁེ་སྤོགས་རྙེད་པ་ལྟ་བུ་དང་། ཞིང་པ་ལོ་ཐོག་ལེགས་པ་ལྟ་བུ་དང་། དཔའ་བོ་གཡུལ་ངོར་རྒྱལ་བ་ལྟ་བུ་དང་། ནད་པ་ནད་ཐམས་ཅད་ལས་ཐར་བ་ལྟ་བུར་གྱུར་ནས་བཅོམ་ལྡན་འདས་ཀྱིས་གསུངས་པ་ལ་མངོན་པར་དགའ་སྟེ་རྗེས་སུ་ཡི་རངས་ནས་བཅོམ་ལྡན་འདས་ཀྱི་ཞབས་གཉིས་ལ་མགོ་བོས་ཕྱག་བྱས་ཏེ། བཅོམ་ལྡན་འདས་ཀྱི་སྤྱན་སྔ་ནས་སོང་ངོ་།
en: Thereupon, like a merchant who had obtained merchandise, like a farmer who had gotten a bumper crop, like a warrior who had won a battle, like a patient who had been cured of every disease, having rejoiced in and praised the words of the Blessed One, the brahmin bowed low until his forehead touched the Blessed One’s feet, and he departed from the Blessed One’s presence.

source: །ཇི་ཙམ་ན་ཞིང་དྲུང་དུ་ཕྱིན་པ་དང་། ཞིང་དེ་ལ་གསེར་གྱི་ནས་ཤེ་དག་སྐྱེས་པར་མཐོང་ངོ་།
en: When he arrived at the field, he saw golden barley growing there.

source: །མཐོང་ནས་ཀྱང་ཡ་མཚན་སྐྱེས་ནས་མིག་བགྲད་དེ་ཚིགས་སུ་བཅད་པས་སྨྲས་པ།
en: Upon seeing it, his eyes opened wide with astonishment and he spoke a verse: “How great the field is, which has

source: ཀྱེ་མ་ཡོན་ཏན་རང་བཞིན་ཞིང་། །ཉེས་ཀུན་རྣམ་པར་སྤངས་པ་ལ།
en: The nature of merit and is free from all faults—

source: །བདག་གིས་དེ་རིང་ས་བོན་བཏབ།
en: From seeds I sowed today,

source: །དེ་རིང་ཉིད་དུ་འབྲས་བུ་ཐོབ།
en: Fruit was harvested just today.”

source: །དེ་ནས་བྲམ་ཟེ་དེ་རིངས་པ་རིངས་པར་རྒྱལ་པོའི་དྲུང་དུ་སོང་ནས་སོན་པ་དང་། རྒྱལ་བ་དང་ཚེ་སྤེལ་བ་དག་བྱས་ནས་རྒྱལ་པོ་ལ་སྨྲས་པ།
en: Thereupon the brahmin hurried to the king. When he arrived, he wished the king victory and long life and said, “Your Majesty, the barley I sowed has become gold.

source: ལྷ་བདག་གིས་སྩང་ནས་སྩལ་བ་དེ་རྣམས་གསེར་ཤེ་དག་ཏུ་གྱུར་གྱིས་དེ་ལ་སྤྱན་ཞིག་བསྐོ་བར་གསོལ།
en: Please appoint an overseer there.”

source: རྒྱལ་པོས་སྤྱན་བསྐོས་ཏེ་བཏང་བ་དང་། བྲམ་ཟེས་ཕུང་པོར་བྱས་ཏེ།
en: The king appointed an overseer and sent him.

source: བགོས་པ་ལས་རྒྱལ་པོའི་སྐལ་བ་ནས་ཐ་མལ་པར་གྱུར་ནས།
en: The brahmin piled the gold up and divided it, but the king’s portion changed into ordinary barley.

source: སྤྱན་གྱིས་རྒྱལ་པོ་ལ་རིག་པར་བྱས་པ་དང་། རྒྱལ་པོས་བསྒོ་བ།
en: The overseer reported this to the king, and then the king ordered, “Have it divided again.” When he divided the barley again, still the king’s portion changed into ordinary barley.

source: ཡང་བགོས་ཤིག །ཡང་བགོས་པ་དང་། དེ་བཞིན་དུ་རྒྱལ་པོའི་སྐལ་བ་ནི་ནས་ཐ་མལ་པར་གྱུར་ནས།
en: He divided it seven times in all, only to have the same result each time.

source: དེ་ལྟར་ལན་བདུན་གྱི་བར་དུ་བགོས་ན་དེ་ཁོ་ན་བཞིན་དུ་ནས་སུ་གྱུར་པ་དང་། རྒྱལ་པོ་ངོ་མཚར་སྐྱེས་ནས་དེ་བདག་ཉིད་སོང་སྟེ་བལྟས་ན་དེ་བཞིན་དུ་གྱུར་ནས་དེས་བྲམ་ཟེ་དེ་ལ་སྨྲས་པ།
en: Prompted by curiosity, the king himself went there and watched, and the result was the same.

source: བྲམ་ཟེ་འདི་ནི་ཁྱོད་ཀྱི་བསོད་ནམས་ལས་སྐྱེས་པ་ཡིན་གྱིས།
en: He said to the brahmin, “Brahmin, since this has been produced by your merit, the king’s portion is no longer required.

source: རྒྱལ་པོའི་སྐལ་བ་ཐོང་ལ་ཁྱོད་ཀྱིས་ཅི་དཔགས་པ་དེ་ཁོ་བོ་ལ་བྱིན་ཅིག །
en: Give me what you have measured.”

source: དེ་ནས་བྲམ་ཟེ་དེ་ཤིན་ཏུ་མགུ་བས་ཅི་བྱིན་པ་དེ་དག་གསེར་གྱི་ནས་ཤེ་དག་ཏུ་གྱུར་ཏོ།
en: Then the brahmin was much delighted, and what he gave became gold. A. The Peasants’ Going Forth and the Oxen’s Rebirth in Heaven After that, the Blessed One departed.

source: །དེ་ནས་བཅོམ་ལྡན་འདས་གཤེགས་པ་དང་། ཇི་ཙམ་ན་ཕྱོགས་གཞན་ཞིག་ན་ཞིང་པ་སྐྱ་བོ་རྦབ་རྦབ་པོ་རྐང་པ་དང་ལག་པ་སེར་ག་བྱུང་བ། ཤ་ནའི་རས་ཀྱི་སྨད་གཡོགས་གྱོན་པ་ལྔ་བརྒྱ་ཞིང་རྨེད་དོ།
en: At that time, in a certain place, five hundred peasants were plowing a field, looking pale, their feet and hands covered with cuts, and wearing hempen lower garments.

source: །རྨོན་པ་དེ་དག་ཀྱང་ལྕག་གཟེར་བུ་ཅན་གྱིས་གཞུས་པས། ལུས་སྨས་ཤིང་རྨ་བྱུང་བས་རྣག་འཛག་ལ་སྔམ་པ་འདོན་བཞིན་དུ་ཞིང་རྨོད་དོ།
en: The oxen, too, were plowing the field with sighs, their bodies hurt and wounded by being struck with spiked sticks, pus oozing from their wounds.

source: །ཞིང་པ་དེ་རྣམས་ཀྱིས་སངས་རྒྱས་བཅོམ་ལྡན་འདས་སྐུ་སྐྱེས་བུ་ཆེན་པོའི་མཚན་སུམ་བཅུ་རྩ་གཉིས་ཀྱིས་ཀུན་ནས་བརྒྱན་པ། དཔེ་བྱད་བཟང་པོ་བརྒྱད་བཅུས་མཛེས་པར་བྱས་པ། འོད་འདོམ་གང་གིས་བརྒྱན་པ། འོད་ཟེར་ཉི་མ་སྟོང་བས་ལྷག་པ། རིན་པོ་ཆེའི་རི་བོ་འགྲོ་བ་ལྟར་ཀུན་ནས་བཟང་བ་མཐོང་ངོ་ཞེས་བྱ་བ་ནས། དགེ་བའི་རྩ་བ་བསགས་པའི་སེམས་ཅན་རྣམས་ལ་ཐོག་མར་སངས་རྒྱས་མཐོང་བ་ནི་ཞེས་བྱ་བའི་བར་གོང་མ་བཞིན་དུའོ།
en: The peasants then saw the Blessed One, whose body was fully ornamented with the thirty-two marks of a great man, illuminated by the eighty minor marks, ornamented with a fathom-wide halo, and beautiful like a moving mountain of jewels with light surpassing a thousand suns. Whenever beings who have accumulated roots of merit look at the Buddha for the first time . . . .

source: །དེ་ནས་བཅོམ་ལྡན་འདས་གང་ན་བ་དེར་དོང་བ་དང་། བཅོམ་ལྡན་འདས་ཀྱིས་རྒྱང་རིང་པོ་ཁོ་ན་ནས་ཞིང་པ་རྣམས་འོང་བ་གཟིགས་སོ། །གཟིགས་ནས་ཀྱང་གདུལ་བའི་དོན་དུ་ལམ་ལ་བཟུར་ནས་དགེ་སློང་གི་དགེ་འདུན་གྱི་གུང་ལ་གདན་བཤམས་པ་ཉིད་ལ་བཞུགས་སོ།
en: They then approached the Blessed One. When from a distance the Blessed One saw the peasants coming, he left the road and sat on the seat prepared for him in front of the community of monks in order to convert the peasants.

source: །དེ་ནས་ཞིང་པ་དེ་རྣམས་ཀྱིས་བཅོམ་ལྡན་འདས་ཀྱི་ཞབས་གཉིས་ལ་མགོ་བོས་ཕྱག་བྱས་ཏེ་ཕྱོགས་གཅིག་ཏུ་འདུག་གོ།
en: The peasants bowed low until their foreheads touched the Blessed One’s feet, and then they sat down to one side.

source: །དེ་ནས་བཅོམ་ལྡན་འདས་ཀྱིས་ཞིང་པ་དེ་རྣམས་ཀྱི་བསམ་པ་དང་། བག་ལ་ཉལ་དང་། ཁམས་དང་། རང་བཞིན་མཁྱེན་ནས་དེ་དང་མཐུན་པའི་འཕགས་པའི་བདེན་པ་བཞི་སོ་སོར་རྟོགས་པར་འགྱུར་བའི་ཆོས་བཤད་པ་མཛད་དེ་ཞེས་བྱ་བ་ནས།
en: The Blessed One knew the peasants’ thinking, proclivity, disposition, and nature and preached the Dharma that was appropriate for them and that caused them to penetrate the four truths of the noble ones . . . .

source: དེ་རྣམས་ཀྱིས་བདེན་པ་མཐོང་ནས་ཞེས་བྱ་བའི་བར་གོང་མ་བཞིན་དུའོ། །བཅོམ་ལྡན་འདས་ག་ལ་བ་དེ་ལོགས་སུ་ཐལ་མོ་སྦྱར་བ་བཏུད་ནས་བཅོམ་ལྡན་འདས་ལ་འདི་སྐད་ཅེས་གསོལ་ཏོ། །བཙུན་པ་ལེགས་པར་གསུངས་པའི་ཆོས་འདུལ་བ་ལ་བདག་ཅག་རབ་ཏུ་འབྱུང་བ་དང་། བསྙེན་པར་རྫོགས་པ་དགེ་སློང་གི་དངོས་པོ་འཐོབ་པ་ལྟ་ན།
en: After having seen the truths, they made the gesture of supplication to the Blessed One and said to him, “O Honored One, we wish to go forth and be ordained monks in the well-taught Dharma and Vinaya.

source: བདག་ཅག་བཅོམ་ལྡན་འདས་ཀྱི་སྤྱན་སྔར་ཚངས་པར་སྤྱོད་པ་སྤྱད་པར་བགྱིའོ།
en: We will lead the pure life in the presence of the Blessed One.”

source: །བཅོམ་ལྡན་འདས་ཀྱིས་དེ་རྣམས་དགེ་སློང་ཚུར་ཤོག་ཅེས་བྱ་བས་རབ་ཏུ་ཕྱུང་ངོ་ཞེས་བྱ་བ་ནས།
en: The Blessed One ordained them by saying, “Come, monk,” . . . . . . .

source: སངས་རྒྱས་དགོངས་པས་ལུས་གཟུགས་བཀབ་པར་གྱུར་ཅེས་བྱ་བའི་བར་གོང་མ་བཞིན་དུའོ།
en: And their bodies swathed in the Buddha’s mind.

source: །བཅོམ་ལྡན་འདས་ཀྱིས་དེ་རྣམས་ལ་གདམས་ངག་བྱིན་ནས་དེ་རྣམས་ཀྱིས་འབད་པ་དང་། བརྩལ་བ་དྲག་པོ་ཞེས་བྱ་བ་ནས་མངོན་དུ་སྨྲ་བར་བྱ་བར་གྱུར་ཏོ། །ཞེས་བྱ་བའི་བར་གོང་མ་བཞིན་དུའོ།
en: The Blessed One instructed them. Endeavoring and striving, they . . . became objects of . . . praise.
